Revit 2025 API
ElectricalCircuitPathMode Enumeration
 An enumerated type indicates the circuit path mode
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum ElectricalCircuitPathMode
Public Enumeration ElectricalCircuitPathMode
public enum class ElectricalCircuitPathMode
type ElectricalCircuitPathMode
Members
Member name | Value | Description
Custom | 0 |  The circuit path is customized by user.
FarthestDevice | 1 |  The circuit path connects to the farthest devices.
AllDevices | 2 |  The circuit path connects to all the devices in the circuits, this mode is compatible to the legacy behavior.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace